results/results_c5_large/results_c5_large_run3/oltp_read_only_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 44.69 qps: 718.68 (r/w/o: 628.90/0.00/89.79) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 72.40 qps: 1157.83 (r/w/o: 1013.03/0.00/144.80) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 61.90 qps: 989.50 (r/w/o: 865.70/0.00/123.80) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 46.70 qps: 748.20 (r/w/o: 654.80/0.00/93.40) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 53.20 qps: 851.20 (r/w/o: 744.80/0.00/106.40) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 58.10 qps: 929.40 (r/w/o: 813.20/0.00/116.20) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 62.60 qps: 1003.90 (r/w/o: 878.70/0.00/125.20) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 60.50 qps: 967.10 (r/w/o: 846.10/0.00/121.00) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 47.70 qps: 760.20 (r/w/o: 664.90/0.00/95.30) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 56.50 qps: 905.00 (r/w/o: 791.90/0.00/113.10) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 48.50 qps: 776.90 (r/w/o: 679.90/0.00/97.00) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 50.20 qps: 804.50 (r/w/o: 704.10/0.00/100.40) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            92876
        write:                           0
        other:                           13268
        total:                           106144
    transactions:                        6634   (55.27 per sec.)
    queries:                             106144 (884.25 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      55.2659
    time elapsed:                        120.0379s
    total number of events:              6634

Latency (ms):
         min:                                   15.59
         avg:                                   72.36
         max:                                  487.03
         95th percentile:                      179.94
         sum:                               480069.27

Threads fairness:
    events (avg/stddev):           1658.5000/12.09
    execution time (avg/stddev):   120.0173/0.01